package homework1.bitwise;

public class BitWiseMain1 {
    public static void main (String [] arg){
        int a = 42;                                                 // двоичный код 0010 1010
        int b = 15;                                                 // двоичный код 0000 1111
        System.out.println("Результат 42|15 равен "+(a|b) );        // результат 0010 1010 | 0000 1111 равен 47 или 0010 1111
        System.out.println("Результат 42 & 15 равен "+(a&b));       // результат 0010 1010 & 0000 1111 равен  10 или 0000 1010
        System.out.println("Результат 42^15 равен "+(a^b));         // результат 0010 1010 ^ 0000 1111 равен 37 или 0010 0101
        System.out.println("Результат ~42 равен "+(~a));            // результат ~0010 1010 равен -43 или 1 1101 0101
        System.out.println("Результат ~15 равен "+(~b));            // результат ~0000 1111 равен -16 или 1 1111 0000
        System.out.println("Результат 42<<2 равен "+(a<<2));        // результат 0010 1010 << 2 равен 168 или 1010 1000
        System.out.println("Результат 15<<2 равен "+(b<<2));        // результат 0000 1111 << 2 равен 60 или 0011 1100
        System.out.println("Результат 42>>2 равен "+(a>>2));        // результат 0010 1010 >> 2 равен 10 или 0000 1010
        System.out.println("Результат 15>>2 равен "+(b>>2));        // результат 0000 1111 >> 2 равен 3  или 0000 0011
        System.out.println("Результат 42>>>2 равен "+(a>>>2));      // результат 0010 1010 >>> 2 равен 10  или 0000 1010
        System.out.println("Результат 15>>>2 равен "+(b>>>2));      // результат 0010 1010 >>> 2 равен 3  или 0000 0011
        System.out.println("Результат 42 >>=4 равен "+(a >>=4));     // результат a=0010 1010>>4 равен 2  или 0000 0010
        a=42;                                                       // устанавливаем a=42 т.к. после операций с присваиванием значение переменной меняется
        System.out.println("Результат a &=b равен "+(a &=b));       // результат a &=b равен 0010 1010 & 0000 1111 равен 10  или 0000 1010
    }
}
