package operators;

public class BitWiseMain2 {
    public static void main (String [] arg){
        int a = -42;                                                // двоичный код 1 1101 0110
        int b = -15;                                                // двоичный код 1 1111 0001
        System.out.println("Результат -42|-15 равен "+(a|b));       // результат 1 1101 0110 | 1 1111 0001 равен -9 или 1 1111 0111
        System.out.println("Результат -42 & -15 равен "+(a&b));     // результат 1 1101 0110 & 1 1111 0001 равен -48 или 1 1101 0000
        System.out.println("Результат -42  ^-15 равен "+(a^b));     // результат 1 1101 0110 ^ 1 1111 0001 равен 39 или 0010 0111
        System.out.println("Результат ~(-42) равен "+(~a));         // результат ~ 1 1101 0110 равен 41 или  0010 1001
        System.out.println("Результат ~(-15) равен "+(~b));         // результат ~ 1 1111 0001 равен 14 или  1110
        System.out.println("Результат -42<<2 равен "+(a<<2));       // результат 1 1101 0110 << 2 равен -168 или 1 0101 1000
        System.out.println("Результат -15<<2 равен "+(b<<2));       // результат 1 1111 0001 <<2 равен -60 или 1 1100 0100
        System.out.println("Результат -42>>2 равен "+(a>>2));       // результат 1 1101 0110 >> 2 равен -11 или 1 1111 0101
        System.out.println("Результат -15>>2 равен "+(b>>2));       // результат 1 1111 0001 >> 2 равен -4  или 1 1111 1100
        System.out.println("Результат -42>>>63 равен "+(a>>>63));   // результат 1 1101 0110 >>> 63 равен 1  или 0000 0001
        System.out.println("Результат -15>>63 равен "+(b>>>63));    // результат 1 1111 0001 >>> 63 равен 1  или 0000 0001
        System.out.println("Результат 42 >>=4 равен "+(a >>=4));    // результат 1 1101 0110 >> 4 равен -3  или 1 1111 1101 при этом в переменную a записывается значение -3, аналогично со всеми операциями присваивания
    }
}
